imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_hashcrypt.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 *
 * LPC55S69 HashCrypt MMIO peripheral model.
 *
 * Register layout per NXP LPC55S69 User Manual / CMSIS periph2/PERI_HASHCRYPT.h:
 *   0x00  CTRL        mode + new_hash + options
 *   0x04  STATUS      waiting/digest/error flags
 *   0x08  INTENSET    interrupt enables (set)
 *   0x0C  INTENCLR    interrupt enables (clear)
 *   0x10  MEMCTRL     AHB master (not emulated)
 *   0x14  MEMADDR     AHB master address (not emulated)
 *   0x20  INDATA      data input (write-only)
 *   0x24..0x3F ALIAS[7] burst aliases for INDATA
 *   0x40..0x5F DIGEST0[8] result digest (read)
 *   0x80  CRYPTCFG    AES mode/key-size/direction
 *   0x84  CONFIG      capability read-only register
 *   0x8C  LOCK
 *   0x90..0x9F MASK[4]
 *   0xA0..0xBF RELOAD[8]
 *   0xD0  PRNG_SEED
 *   0xD8  PRNG_OUT
 *
 * Note: the CMSIS register struct ends at 0xDC.  We size the region to 0xE0
 * to cover the full aligned block; the extra 4 bytes at 0xDC..0xDF are R/W
 * stub registers.
 *
 * Key behaviours emulated:
 *  - SHA-256: CTRL.MODE=2, NEW_HASH=1 → stream init.
 *    Writes to INDATA/ALIAS accumulate 4-byte words.
 *    First read of DIGEST0 finalises the hash and clears WAITING.
 *  - AES-ECB/CBC/CTR: CTRL.MODE=4, CRYPTCFG selects mode/keysize/direction.
 *    INDATA/ALIAS writes collect 16-byte blocks (plus key/IV on NEW).
 *    DIGEST0..3 reads drain the output block.
 *  - No-wolfSSL: accepts all writes, returns all-zero digest, sets DIGEST so
 *    firmware polling loops are not infinite.
 *
 * IRQ: HASHCRYPT_IRQn = 54 (LPC55S69 CM33 core0 CMSIS header).
 */

#include <string.h>
#include <stddef.h>
#include "lpc55s69_hashcrypt.h"
#include "../mm_host_crypto.h"
#include "m33mu/nvic.h"

#ifdef M33MU_HAS_WOLFSSL
#include <wolfssl/options.h>
#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/sha256.h>
#endif

/* -------------------------------------------------------------------------
 * Register offsets
 * ------------------------------------------------------------------------- */
#define HC_OFF_CTRL       0x00u
#define HC_OFF_STATUS     0x04u
#define HC_OFF_INTENSET   0x08u
#define HC_OFF_INTENCLR   0x0Cu
#define HC_OFF_MEMCTRL    0x10u
#define HC_OFF_MEMADDR    0x14u
/* 0x18..0x1F reserved */
#define HC_OFF_INDATA     0x20u
#define HC_OFF_ALIAS_0    0x24u  /* ALIAS[0..6] = 0x24..0x3C */
#define HC_OFF_ALIAS_6    0x3Cu
#define HC_OFF_DIGEST0    0x40u  /* DIGEST0[0..7] = 0x40..0x5C */
#define HC_OFF_DIGEST7    0x5Cu
/* 0x60..0x7F reserved */
#define HC_OFF_CRYPTCFG   0x80u
#define HC_OFF_CONFIG     0x84u
/* 0x88 reserved */
#define HC_OFF_LOCK       0x8Cu
#define HC_OFF_MASK_0     0x90u  /* MASK[0..3] = 0x90..0x9C */
#define HC_OFF_MASK_3     0x9Cu
#define HC_OFF_RELOAD_0   0xA0u  /* RELOAD[0..7] = 0xA0..0xBC */
#define HC_OFF_RELOAD_7   0xBCu
/* 0xC0..0xCF reserved */
#define HC_OFF_PRNG_SEED  0xD0u
/* 0xD4 reserved */
#define HC_OFF_PRNG_OUT   0xD8u

/* We expose 0xE0 bytes so we cover the full CMSIS struct plus a small pad */
#define HC_SIZE           0xE0u

/* -------------------------------------------------------------------------
 * CTRL bits
 * ------------------------------------------------------------------------- */
#define CTRL_MODE_MASK    0x07u
#define CTRL_MODE_DISABLED 0u
#define CTRL_MODE_SHA1    1u
#define CTRL_MODE_SHA256  2u
#define CTRL_MODE_AES     4u
#define CTRL_NEW_HASH     (1u << 4)
#define CTRL_RELOAD_BIT   (1u << 5)
#define CTRL_HASHSWPB     (1u << 12)

/* -------------------------------------------------------------------------
 * STATUS bits
 * ------------------------------------------------------------------------- */
#define STATUS_WAITING    (1u << 0)
#define STATUS_DIGEST     (1u << 1)
#define STATUS_ERROR      (1u << 2)
#define STATUS_NEEDKEY    (1u << 4)
#define STATUS_NEEDIV     (1u << 5)

/* -------------------------------------------------------------------------
 * INTENSET / INTENCLR bits
 * ------------------------------------------------------------------------- */
#define INTEN_WAITING     (1u << 0)
#define INTEN_DIGEST      (1u << 1)
#define INTEN_ERROR       (1u << 2)

/* -------------------------------------------------------------------------
 * CRYPTCFG bits
 * ------------------------------------------------------------------------- */
#define CRYPTCFG_AESMODE_SHIFT  4u
#define CRYPTCFG_AESMODE_MASK   (0x3u << CRYPTCFG_AESMODE_SHIFT)
#define CRYPTCFG_AESMODE_ECB    (0u << CRYPTCFG_AESMODE_SHIFT)
#define CRYPTCFG_AESMODE_CBC    (1u << CRYPTCFG_AESMODE_SHIFT)
#define CRYPTCFG_AESMODE_CTR    (2u << CRYPTCFG_AESMODE_SHIFT)
#define CRYPTCFG_AESDECRYPT     (1u << 6)
#define CRYPTCFG_AESKEYSZ_SHIFT 8u
#define CRYPTCFG_AESKEYSZ_MASK  (0x3u << CRYPTCFG_AESKEYSZ_SHIFT)
#define CRYPTCFG_AESKEYSZ_128   (0u << CRYPTCFG_AESKEYSZ_SHIFT)
#define CRYPTCFG_AESKEYSZ_192   (1u << CRYPTCFG_AESKEYSZ_SHIFT)
#define CRYPTCFG_AESKEYSZ_256   (2u << CRYPTCFG_AESKEYSZ_SHIFT)
#define CRYPTCFG_SWAPKEY        (1u << 1)
#define CRYPTCFG_SWAPDAT        (1u << 2)
#define CRYPTCFG_MSW1ST         (1u << 3)
#define CRYPTCFG_MSW1ST_OUT     (1u << 0)

/* CONFIG value: AES=bit6, AESKEY=bit7, DMA=bit1, DUAL=bit0
 * (0x40|0x80|0x02|0x01 = 0xC3, but shift to match value 0x000C2000 from
 * an older LPC55S69 revision — CONFIG was in a BLOCK_IDR-style field.
 * We return 0x000C2000 as the plan says, using that as CONFIG@0x84.
 * Assumption: older SDK versions read CONFIG at 0x84 to get 0x000C2000. */
#define HC_CONFIG_VAL     0x000C2000u  /* DUAL|DMA|AHB|AES|AESKEY per plan */

/* HashCrypt IRQ number (HASHCRYPT_IRQn = 54 per LPC55S69_cm33_core0.h) */
#define HASHCRYPT_IRQn    54u

/* -------------------------------------------------------------------------
 * Forward declarations
 * ------------------------------------------------------------------------- */
static void hc_deliver_irq(struct mm_lpc55_hashcrypt *hc, mm_u32 which);
static void hc_indata_push(struct mm_lpc55_hashcrypt *hc, mm_u32 value);

/* -------------------------------------------------------------------------
 * Reset
 * ------------------------------------------------------------------------- */
mm_bool mm_lpc55_hashcrypt_reset(struct mm_lpc55_hashcrypt *hc)
{
    struct mm_nvic *nvic_save;
    if (hc == NULL) return MM_FALSE;
    nvic_save = hc->nvic;
    memset(hc, 0, sizeof(*hc));
    hc->nvic = nvic_save;
    /* CONFIG is read-only and reports capabilities */
    hc->regs[HC_OFF_CONFIG / 4u] = HC_CONFIG_VAL;
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * Init
 * ------------------------------------------------------------------------- */
mm_bool mm_lpc55_hashcrypt_init(struct mm_lpc55_hashcrypt *hc,
                                struct mm_nvic *nvic)
{
    if (hc == NULL) return MM_FALSE;
    memset(hc, 0, sizeof(*hc));
    hc->nvic = nvic;
    hc->regs[HC_OFF_CONFIG / 4u] = HC_CONFIG_VAL;
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * IRQ pulse helper
 * ------------------------------------------------------------------------- */
static void hc_deliver_irq(struct mm_lpc55_hashcrypt *hc, mm_u32 which)
{
    if (hc->nvic == NULL) return;
    if ((hc->intenset & which) != 0u) {
        mm_nvic_set_pending(hc->nvic, HASHCRYPT_IRQn, MM_TRUE);
    }
}

/* -------------------------------------------------------------------------
 * AES key/IV byte builder (little-endian word → big-endian bytes)
 * The HashCrypt hardware stores key/IV in little-endian word order by
 * default (CRYPTCFG.MSW1ST=0, CRYPTCFG.SWAPKEY=0).
 * wolfSSL expects big-endian byte keys.
 * Each word written by firmware is LE; we store it as-is in aes_key[],
 * then convert to bytes in aes_build_key_bytes().
 * ------------------------------------------------------------------------- */
static void aes_build_key_bytes(const mm_u32 *words, mm_u32 n_words, mm_u8 *out)
{
    mm_u32 i;
    for (i = 0u; i < n_words; ++i) {
        mm_u32 w = words[i];
        out[i * 4u]      = (mm_u8)((w)       & 0xffu);
        out[i * 4u + 1u] = (mm_u8)((w >> 8)  & 0xffu);
        out[i * 4u + 2u] = (mm_u8)((w >> 16) & 0xffu);
        out[i * 4u + 3u] = (mm_u8)((w >> 24) & 0xffu);
    }
}

/* -------------------------------------------------------------------------
 * SHA-256 block processing: apply compression to one 64-byte (16-word) block.
 *
 * The HashCrypt hardware expects firmware to supply the complete SHA-256
 * message schedule including padding.  The hardware applies the compression
 * function (no message-length management) to each 512-bit block.
 * We replicate this using wc_Sha256Transform if available, which applies
 * the SHA-256 compression without adding its own padding.
 *
 * Byte ordering: each LE 32-bit word written by the ARM core is byte-swapped
 * by the hardware before the SHA engine processes it:
 *   ARM writes word 0x64636261 → hardware bytes: 0x61,0x62,0x63,0x64 = "abcd"
 * We replicate this: extract each word in LE order (LSB first).
 * ------------------------------------------------------------------------- */
static void sha_process_block(struct mm_lpc55_hashcrypt *hc)
{
#ifdef M33MU_HAS_WOLFSSL
    mm_u8 block[64];
    mm_u32 i;
    wc_Sha256 *sha = (wc_Sha256 *)(void *)hc->sha_ctx.opaque;

    if (!hc->sha_inited || hc->inbuf_count < 16u) return;

