imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_hashcrypt.c
    /* wc_Sha256Transform on a little-endian (x86) host expects the 64-byte
     * block in a specific byte layout.  Empirical testing shows it needs the
     * block words byte-reversed compared to the firmware LE words:
     *
     *   Firmware writes "abc\x80" as LE word 0x80636261.
     *   Transform needs word in memory as bytes [0x80, 0x63, 0x62, 0x61].
     *   uint32_t 0x80636261 in x86 memory = bytes [0x61, 0x62, 0x63, 0x80].
     *   So we must byte-reverse each word: 0x80636261 → stored as [0x80,0x63,0x62,0x61].
     *   Equivalently: new_word[i] = bswap32(inbuf[i]).
     *
     * This matches the test: Transform(block_le) with block_le[0..3]=[0x80,0x63,0x62,0x61]
     * gives SHA-256("abc") = ba7816bf... ✓ */
    for (i = 0u; i < 16u; ++i) {
        mm_u32 w = hc->inbuf[i];
        /* byte-swap: MSByte first in the byte array */
        block[i * 4u]      = (mm_u8)((w >> 24) & 0xffu);
        block[i * 4u + 1u] = (mm_u8)((w >> 16) & 0xffu);
        block[i * 4u + 2u] = (mm_u8)((w >>  8) & 0xffu);
        block[i * 4u + 3u] = (mm_u8)((w)       & 0xffu);
    }
    wc_Sha256Transform(sha, block);
    hc->inbuf_count = 0u;
#else
    hc->inbuf_count = 0u;
#endif
}

/* -------------------------------------------------------------------------
 * SHA-256 finalise and populate DIGEST0 registers.
 * After all blocks have been processed via sha_process_block(), extract
 * the running hash from the wc_Sha256 internal digest[] field.
 * ------------------------------------------------------------------------- */
static void sha_finalise(struct mm_lpc55_hashcrypt *hc)
{
    mm_u32 i;
#ifdef M33MU_HAS_WOLFSSL
    wc_Sha256 *sha = (wc_Sha256 *)(void *)hc->sha_ctx.opaque;
#endif

    if (!hc->sha_inited) {
        /* No wolfSSL or not started — zero digest, firmware won't hang */
        memset(hc->digest, 0, sizeof(hc->digest));
    } else {
        /* Flush any remaining partial block (shouldn't happen in correct
         * firmware that supplies full padded blocks, but be robust) */
        if (hc->inbuf_count > 0u) {
#ifdef M33MU_HAS_WOLFSSL
            /* Less than 16 words — pad to 16 and process */
            while (hc->inbuf_count < 16u) {
                hc->inbuf[hc->inbuf_count++] = 0u;
            }
            wc_Sha256Transform(sha, (const unsigned char *)hc->inbuf);
            hc->inbuf_count = 0u;
#endif
        }
#ifdef M33MU_HAS_WOLFSSL
        {
            /* Extract digest from wc_Sha256 internal state.
             * After wc_Sha256Transform, digest[] holds the running hash.
             * On x86 (LE host), each word is stored in native LE byte order.
             * digest[0] on x86 = 0xBA7816BF stored as bytes [BF, 16, 78, BA].
             * We want to output bytes [BA, 78, 16, BF] (big-endian / SHA spec order).
             * So we byte-reverse each word. */
            for (i = 0u; i < 8u; ++i) {
                mm_u32 d = sha->digest[i];
                hc->digest[i * 4u]      = (mm_u8)((d >> 24) & 0xffu);
                hc->digest[i * 4u + 1u] = (mm_u8)((d >> 16) & 0xffu);
                hc->digest[i * 4u + 2u] = (mm_u8)((d >> 8)  & 0xffu);
                hc->digest[i * 4u + 3u] = (mm_u8)((d)       & 0xffu);
            }
        }
#else
        memset(hc->digest, 0, sizeof(hc->digest));
#endif
        hc->sha_inited = MM_FALSE;
    }
    /* Populate DIGEST0[0..7] — hardware returns big-endian words */
    for (i = 0u; i < 8u; ++i) {
        hc->regs[(HC_OFF_DIGEST0 / 4u) + i] =
            ((mm_u32)hc->digest[i * 4u]      << 24) |
            ((mm_u32)hc->digest[i * 4u + 1u] << 16) |
            ((mm_u32)hc->digest[i * 4u + 2u] << 8)  |
            ((mm_u32)hc->digest[i * 4u + 3u]);
    }
    hc->digest_ready = MM_TRUE;
    hc->regs[HC_OFF_STATUS / 4u] &= ~STATUS_WAITING;
    hc->regs[HC_OFF_STATUS / 4u] |=  STATUS_DIGEST;
    hc_deliver_irq(hc, INTEN_DIGEST);
}

/* -------------------------------------------------------------------------
 * AES: run one 16-byte block on current key/mode
 * ------------------------------------------------------------------------- */
static void aes_process_block(struct mm_lpc55_hashcrypt *hc)
{
    mm_u8 key_bytes[32];
    mm_u8 iv_bytes[16];
    mm_u8 in_bytes[16];
    mm_u32 key_len;
    mm_u32 cryptcfg;
    mm_u32 aesmode;
    mm_bool decrypt;
    mm_bool ok;
    mm_u32 i;
    mm_u32 keysz;

    cryptcfg = hc->regs[HC_OFF_CRYPTCFG / 4u];
    keysz = (cryptcfg & CRYPTCFG_AESKEYSZ_MASK) >> CRYPTCFG_AESKEYSZ_SHIFT;
    switch (keysz) {
    case 1u:  key_len = 24u; break;
    case 2u:  key_len = 32u; break;
    default:  key_len = 16u; break;
    }
    aesmode = (cryptcfg & CRYPTCFG_AESMODE_MASK) >> CRYPTCFG_AESMODE_SHIFT;
    decrypt = (cryptcfg & CRYPTCFG_AESDECRYPT) != 0u;

    /* Build key and input bytes (LE words → bytes) */
    aes_build_key_bytes(hc->aes_key, key_len / 4u, key_bytes);
    aes_build_key_bytes(hc->inbuf, 4u, in_bytes);
    aes_build_key_bytes(hc->aes_iv, AES_IV_WORDS, iv_bytes);

    ok = MM_FALSE;
    switch (aesmode) {
    case 0u: /* ECB */
        if (decrypt)
            ok = mm_host_aes_ecb_dec(key_bytes, key_len, in_bytes, hc->aes_out, 16u);
        else
            ok = mm_host_aes_ecb_enc(key_bytes, key_len, in_bytes, hc->aes_out, 16u);
        break;
    case 1u: /* CBC */
        if (decrypt)
            ok = mm_host_aes_cbc_dec(key_bytes, key_len, iv_bytes, in_bytes, hc->aes_out, 16u);
        else
            ok = mm_host_aes_cbc_enc(key_bytes, key_len, iv_bytes, in_bytes, hc->aes_out, 16u);
        if (ok) {
            /* Update IV for chaining: for encrypt, IV = ciphertext; for decrypt, IV = input */
            const mm_u8 *new_iv = decrypt ? in_bytes : hc->aes_out;
            aes_build_key_bytes(hc->aes_iv, 4u, iv_bytes); /* unused */
            for (i = 0u; i < 4u; ++i) {
                hc->aes_iv[i] = ((mm_u32)new_iv[i * 4u]) |
                                 ((mm_u32)new_iv[i * 4u + 1u] << 8) |
                                 ((mm_u32)new_iv[i * 4u + 2u] << 16) |
                                 ((mm_u32)new_iv[i * 4u + 3u] << 24);
            }
        }
        break;
    case 2u: /* CTR */
        ok = mm_host_aes_ctr(key_bytes, key_len, iv_bytes, in_bytes, hc->aes_out, 16u);
        break;
    default:
        break;
    }

    if (!ok) {
        memset(hc->aes_out, 0, sizeof(hc->aes_out));
    }

    /* Populate DIGEST0[0..3] with output (same word order as input) */
    for (i = 0u; i < 4u; ++i) {
        hc->regs[(HC_OFF_DIGEST0 / 4u) + i] =
            ((mm_u32)hc->aes_out[i * 4u])       |
            ((mm_u32)hc->aes_out[i * 4u + 1u] << 8) |
            ((mm_u32)hc->aes_out[i * 4u + 2u] << 16) |
            ((mm_u32)hc->aes_out[i * 4u + 3u] << 24);
    }
    hc->aes_out_word = 0u;
    hc->aes_out_ready = MM_TRUE;
    hc->inbuf_count = 0u;

    /* Signal digest ready, accept more data */
    hc->regs[HC_OFF_STATUS / 4u] |= STATUS_DIGEST | STATUS_WAITING;
    hc_deliver_irq(hc, INTEN_DIGEST);
}

/* -------------------------------------------------------------------------
 * Core INDATA push (shared by INDATA and ALIAS writes)
 * ------------------------------------------------------------------------- */
static void hc_indata_push(struct mm_lpc55_hashcrypt *hc, mm_u32 value)
{
    if (hc->mode == CTRL_MODE_SHA256 || hc->mode == CTRL_MODE_SHA1) {
        /* Buffer words — SHA block = 16 words = 64 bytes */
        if (hc->inbuf_count < INBUF_WORDS_MAX) {
            hc->inbuf[hc->inbuf_count++] = value;
        }
        /* When a full 64-byte (16-word) block is accumulated, process it */
        if (hc->inbuf_count == 16u) {
            sha_process_block(hc);
            /* Remain WAITING for more data */
            hc->regs[HC_OFF_STATUS / 4u] |= STATUS_WAITING;
        }
        /* Clear DIGEST flag when new data arrives */
        hc->regs[HC_OFF_STATUS / 4u] &= ~STATUS_DIGEST;
        hc->digest_ready = MM_FALSE;

    } else if (hc->mode == CTRL_MODE_AES) {
        if (hc->aes_needs_key) {
            /* Collect key words */
            if (hc->aes_key_recvd < hc->aes_key_words) {
                hc->aes_key[hc->aes_key_recvd++] = value;
            }
            if (hc->aes_key_recvd >= hc->aes_key_words) {
                hc->aes_key_ready = MM_TRUE;
                hc->aes_needs_key = MM_FALSE;
                if (hc->aes_needs_iv) {
                    /* Now need IV */
                    hc->regs[HC_OFF_STATUS / 4u] =
                        (hc->regs[HC_OFF_STATUS / 4u] & ~STATUS_NEEDKEY) | STATUS_NEEDIV | STATUS_WAITING;
                } else {
                    hc->regs[HC_OFF_STATUS / 4u] =
                        (hc->regs[HC_OFF_STATUS / 4u] & ~(STATUS_NEEDKEY | STATUS_NEEDIV)) | STATUS_WAITING;
                }
            }
        } else if (hc->aes_needs_iv) {
            /* Collect IV words */
            if (hc->aes_iv_recvd < AES_IV_WORDS) {
                hc->aes_iv[hc->aes_iv_recvd++] = value;
            }
            if (hc->aes_iv_recvd >= AES_IV_WORDS) {
                hc->aes_iv_ready = MM_TRUE;
                hc->aes_needs_iv = MM_FALSE;
                hc->regs[HC_OFF_STATUS / 4u] =
                    (hc->regs[HC_OFF_STATUS / 4u] & ~(STATUS_NEEDKEY | STATUS_NEEDIV)) | STATUS_WAITING;
            }
        } else {
            /* Collect data block (4 words = 16 bytes) */
            if (hc->inbuf_count < 4u) {
                hc->inbuf[hc->inbuf_count++] = value;
            }
            if (hc->inbuf_count == 4u) {
                hc->regs[HC_OFF_STATUS / 4u] &= ~STATUS_WAITING;
                aes_process_block(hc);
            }
        }
    }
}

/* -------------------------------------------------------------------------
 * Handle CTRL write (NEW_HASH / mode change)
 * ------------------------------------------------------------------------- */
static void hc_ctrl_write(struct mm_lpc55_hashcrypt *hc, mm_u32 value)
{
    mm_u32 new_mode = value & CTRL_MODE_MASK;
    mm_u32 new_hash = value & CTRL_NEW_HASH;

    hc->regs[HC_OFF_CTRL / 4u] = value & ~CTRL_NEW_HASH; /* NEW_HASH self-clears */
    hc->mode = new_mode;

