imbluedabr/m33mu/cpu/lpc55s69/lpc55s69_hashcrypt.c
    if (new_hash) {
        /* Reset digest state */
        hc->digest_ready = MM_FALSE;
        hc->inbuf_count = 0u;
        hc->regs[HC_OFF_STATUS / 4u] &= ~(STATUS_DIGEST | STATUS_WAITING |
                                           STATUS_NEEDKEY | STATUS_NEEDIV);

        if (new_mode == CTRL_MODE_SHA256) {
            /* Initialise the wc_Sha256 state (sets IV).
             * We'll use wc_Sha256Transform for each 64-byte block. */
            hc->sha_inited = mm_host_sha256_stream_init(&hc->sha_ctx);
            hc->regs[HC_OFF_STATUS / 4u] |= STATUS_WAITING;

        } else if (new_mode == CTRL_MODE_AES) {
            mm_u32 cryptcfg = hc->regs[HC_OFF_CRYPTCFG / 4u];
            mm_u32 aesmode  = (cryptcfg & CRYPTCFG_AESMODE_MASK) >> CRYPTCFG_AESMODE_SHIFT;
            mm_u32 keysz    = (cryptcfg & CRYPTCFG_AESKEYSZ_MASK) >> CRYPTCFG_AESKEYSZ_SHIFT;

            /* Determine how many key words firmware must write */
            switch (keysz) {
            case 1u: hc->aes_key_words = 6u; break;  /* 192-bit */
            case 2u: hc->aes_key_words = 8u; break;  /* 256-bit */
            default: hc->aes_key_words = 4u; break;  /* 128-bit */
            }
            hc->aes_key_recvd = 0u;
            hc->aes_key_ready = MM_FALSE;
            hc->aes_iv_recvd  = 0u;
            hc->aes_iv_ready  = MM_FALSE;
            hc->aes_out_ready = MM_FALSE;
            hc->aes_out_word  = 0u;

            /* Need IV for CBC/CTR, not for ECB */
            hc->aes_needs_key = MM_TRUE;
            hc->aes_needs_iv  = (aesmode == 1u || aesmode == 2u) ? MM_TRUE : MM_FALSE;
            hc->regs[HC_OFF_STATUS / 4u] |= STATUS_WAITING | STATUS_NEEDKEY;
            if (hc->aes_needs_iv) {
                hc->regs[HC_OFF_STATUS / 4u] |= STATUS_NEEDIV;
            }

        } else if (new_mode == CTRL_MODE_SHA1) {
            /* SHA-1 not fully emulated — accept writes, return zero digest */
            hc->sha_inited = MM_FALSE;
            hc->regs[HC_OFF_STATUS / 4u] |= STATUS_WAITING;
        }
    }
}

/* -------------------------------------------------------------------------
 * Read callback
 * ------------------------------------------------------------------------- */
mm_bool mm_lpc55_hashcrypt_read(void *opaque, mm_u32 offset,
                                mm_u32 size_bytes, mm_u32 *value_out)
{
    struct mm_lpc55_hashcrypt *hc = (struct mm_lpc55_hashcrypt *)opaque;
    mm_u32 val;

    if (hc == NULL || value_out == NULL) return MM_FALSE;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > HC_SIZE) return MM_FALSE;

    /* DIGEST0[0..7] — first read triggers finalisation for SHA-256 */
    if (offset >= HC_OFF_DIGEST0 && offset <= HC_OFF_DIGEST7 &&
        size_bytes == 4u) {
        mm_u32 didx = (offset - HC_OFF_DIGEST0) / 4u;
        if (!hc->digest_ready && hc->mode == CTRL_MODE_SHA256) {
            sha_finalise(hc);
        }
        val = hc->regs[(HC_OFF_DIGEST0 / 4u) + didx];
        memcpy(value_out, &val, size_bytes);
        return MM_TRUE;
    }

    /* STATUS — computed on every read */
    if (offset == HC_OFF_STATUS) {
        val = hc->regs[HC_OFF_STATUS / 4u];
        memcpy(value_out, &val, size_bytes);
        return MM_TRUE;
    }

    /* CONFIG / INFO — capability register (read-only) */
    if (offset == HC_OFF_CONFIG) {
        val = HC_CONFIG_VAL;
        memcpy(value_out, &val, size_bytes);
        return MM_TRUE;
    }

    /* Default: register file */
    memcpy(value_out, (const mm_u8 *)hc->regs + offset, size_bytes);
    return MM_TRUE;
}

/* -------------------------------------------------------------------------
 * Write callback
 * ------------------------------------------------------------------------- */
mm_bool mm_lpc55_hashcrypt_write(void *opaque, mm_u32 offset,
                                 mm_u32 size_bytes, mm_u32 value)
{
    struct mm_lpc55_hashcrypt *hc = (struct mm_lpc55_hashcrypt *)opaque;

    if (hc == NULL) return MM_FALSE;
    if (size_bytes == 0u || size_bytes > 4u) return MM_FALSE;
    if ((offset + size_bytes) > HC_SIZE) return MM_FALSE;

    switch (offset) {
    case HC_OFF_CTRL:
        hc_ctrl_write(hc, value);
        break;

    case HC_OFF_STATUS:
        /* W1C: error and fault bits */
        hc->regs[HC_OFF_STATUS / 4u] &= ~(value & (STATUS_ERROR));
        break;

    case HC_OFF_INTENSET:
        hc->intenset |= value;
        hc->regs[HC_OFF_INTENSET / 4u] = hc->intenset;
        break;

    case HC_OFF_INTENCLR:
        hc->intenset &= ~value;
        hc->regs[HC_OFF_INTENSET / 4u] = hc->intenset;
        hc->regs[HC_OFF_INTENCLR / 4u] = 0u; /* write-only, reads as 0 */
        break;

    case HC_OFF_INDATA:
        hc_indata_push(hc, value);
        break;

    case HC_OFF_CONFIG:
        /* Read-only — silently ignore writes */
        break;

    default:
        /* ALIAS registers */
        if (offset >= HC_OFF_ALIAS_0 && offset <= HC_OFF_ALIAS_6 &&
            (offset & 3u) == 0u) {
            hc_indata_push(hc, value);
            break;
        }
        /* All other registers: plain store */
        if ((offset + size_bytes) <= HC_SIZE) {
            memcpy((mm_u8 *)hc->regs + offset, &value, size_bytes);
        }
        break;
    }

    return MM_TRUE;
}
